{
  "_class_name": "PI0Policy",
  "_diffusers_version": "0.36.0",
  "action_norm_stats": {
    "mean": [
      -0.002878767613393927,
      -0.021688478333624618,
      0.012202553347768295,
      0.002077253270573438,
      -0.007406934190225423,
      -0.00045921194454169085,
      0.028089823934155142,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0
    ],
    "q01": [
      -0.5938025059223175,
      -1.1207641136646271,
      -0.5472147151350975,
      -0.7114100896358491,
      -0.35004664956331255,
      -0.6927156522750855,
      0.0010499999625608325,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0
    ],
    "q99": [
      0.42896274900436415,
      1.1466629072427748,
      0.7498302414536475,
      0.7743690593481061,
      0.3017275422334671,
      0.8144905326843261,
      0.06935793175944127,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0
    ],
    "std": [
      0.19121062311737014,
      0.41880365521447555,
      0.22876734467744272,
      0.2451806298304897,
      0.11785363501713264,
      0.24184953542792215,
      0.03129750489482799,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0
    ]
  },
  "architectures": [
    "PI0ForActionPrediction"
  ],
  "attn_implementation": "eager",
  "bos_token_id": 2,
  "double_q": true,
  "eos_token_id": 1,
  "max_action_dim": 32,
  "max_state_dim": 32,
  "model_type": "pi0_torch",
  "n_action_steps": 50,
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "num_steps": 10,
  "pad_token_id": 0,
  "pi05_enabled": true,
  "proj_width": 1024,
  "sac_enable": true,
  "state_norm_stats": {
    "mean": [
      -0.09126036839036254,
      0.985582088657768,
      -0.48064446686271267,
      -0.2728994716011939,
      0.1345750035342312,
      0.155272926592341,
      0.03153799627060532,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0
    ],
    "q01": [
      -0.48848038754463197,
      -0.0021107241045683622,
      -0.9409464772627689,
      -1.258489978313446,
      -0.2830376383662224,
      -1.2131255146503448,
      0.0010499999625608325,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0
    ],
    "q99": [
      0.41731690230369567,
      1.5978382370865438,
      0.001692354104015914,
      1.1599183917045597,
      0.53804875010252,
      1.1752314011812213,
      0.06935793175944127,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0
    ],
    "std": [
      0.2310757079622668,
      0.5246091353902639,
      0.28290969263989485,
      0.4139658786182663,
      0.16513652597707232,
      0.4242621099123836,
      0.031660037592466286,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0
    ]
  },
  "transformers_version": "4.57.3",
  "use_cache": true
}
